dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_structure.h
/** Declares active sensor details */
typedef struct
{
    void (* ptrISRCallback)(void * context);                    /**< Pointer to the interrupt handler of the active sensor */

    const cy_stc_capsense_widget_config_t * ptrWdConfig;        /**< Pointer to the widget configuration structure of the active sensor */
    cy_stc_capsense_widget_context_t * ptrWdContext;            /**< Pointer to the widget context structure of the active sensor */

    const cy_stc_capsense_electrode_config_t * ptrEltdConfig;   /**< Pointer to the electrode configuration structure of the active sensor */
    const cy_stc_capsense_electrode_config_t * ptrRxConfig;     /**< Pointer to the Rx electrode configuration structure of the active sensor */
    const cy_stc_capsense_electrode_config_t * ptrTxConfig;     /**< Pointer to the Tx electrode configuration structure of the active sensor */

    cy_stc_capsense_sensor_context_t * ptrSnsContext;           /**< Pointer to the sensor context structure */

    volatile uint16_t sensorIndex;                              /**< Current sensor ID */    
    volatile uint8_t widgetIndex;                               /**< Current widget ID */
    volatile uint8_t rxIndex;                                   /**< Current Rx ID */
    volatile uint8_t txIndex;                                   /**< Current Tx ID */
    volatile uint8_t connectedSnsState;                         /**< Shows if the current sensor is connected to analog bus */
    volatile uint8_t scanScopeAll;                              /**< Request of scanning all widgets */
    volatile uint8_t scanScopeSns;                              /**< Request of scanning a single sensor */
    volatile uint8_t mfsChannelIndex;                           /**< MFS channel index */
    volatile uint8_t currentSenseMethod;                        /**< Current sensing method */
} cy_stc_active_scan_sns_t;


/** Declares internal Context Data Structure */
typedef struct
{
    uint32_t csdInactiveSnsDm;                                  /**< Internal pre-calculated data for faster operation */
    uint32_t csdRegConfig;                                      /**< Internal pre-calculated data for faster operation */
    uint32_t csdRegSwHsPSelScan;                                /**< Internal pre-calculated data for faster operation */
    uint32_t csdRegSwHsPSelInit;                                /**< Internal pre-calculated data for faster operation */
    uint32_t csdRegSwBypSel;                                    /**< Internal pre-calculated data for faster operation */
    uint32_t csdRegSwResScan;                                   /**< Internal pre-calculated data for faster operation */
    uint32_t csdRegSwResInit;                                   /**< Internal pre-calculated data for faster operation */
    uint32_t csdRegAmuxbufInit;                                 /**< Internal pre-calculated data for faster operation */
    uint32_t csdRegSwAmuxbufSel;                                /**< Internal pre-calculated data for faster operation */
    uint32_t csdRegSwShieldSelScan;                             /**< Internal pre-calculated data for faster operation */
    uint32_t csdRegSwShieldSelInit;                             /**< Internal pre-calculated data for faster operation */
    uint32_t csdRegHscmpInit;                                   /**< Internal pre-calculated data for faster operation */
    uint32_t csdRegHscmpScan;                                   /**< Internal pre-calculated data for faster operation */
    uint32_t csdIdacAConfig;                                    /**< Internal pre-calculated data for faster operation */
    uint32_t csdIdacBConfig;                                    /**< Internal pre-calculated data for faster operation */
    uint32_t csdRegSwFwTankSelScan;                             /**< Internal pre-calculated data for faster operation */
    uint32_t csdRegSwFwTankSelInit;                             /**< Internal pre-calculated data for faster operation */
    uint32_t csdRegSwCmpPSel;                                   /**< Internal pre-calculated data for faster operation */
    uint32_t csdRegIoSel;                                       /**< Internal pre-calculated data for faster operation */
    uint32_t csdRegRefgen;                                      /**< Internal pre-calculated data for faster operation */
    uint32_t csxRegConfigInit;                                  /**< Internal pre-calculated data for faster operation */
    uint32_t csxRegConfigScan;                                  /**< Internal pre-calculated data for faster operation */
    uint32_t csxRegSwResInit;                                   /**< Internal pre-calculated data for faster operation */
    uint32_t csxRegSwResPrech;                                  /**< Internal pre-calculated data for faster operation */
    uint32_t csxRegSwResScan;                                   /**< Internal pre-calculated data for faster operation */
    uint32_t csxRegRefgen;                                      /**< Internal pre-calculated data for faster operation */
    uint32_t regSwRefGenSel;                                    /**< Internal pre-calculated data for faster operation */

    uint8_t csdCmodConnection;                                  /**< Internal pre-calculated data for faster operation */
    uint8_t csdCshConnection;                                   /**< Internal pre-calculated data for faster operation */
    en_hsiom_sel_t csdInactiveSnsHsiom;                         /**< Internal pre-calculated data for faster operation */
    uint8_t csdVrefGain;                                        /**< Internal pre-calculated data for faster operation */
    uint16_t csdVrefVoltageMv;                                  /**< Internal pre-calculated data for faster operation */
}cy_stc_capsense_internal_context_t;

/**
* Provides the typedef for the callback function that is intended to be called when
* the \ref cy_en_capsense_callback_event_t events occurs.
*/
typedef void (*cy_capsense_callback_t)(cy_stc_active_scan_sns_t * ptrActiveScan);
typedef void (*cy_capsense_tuner_send_callback_t)(void * context);
typedef void (*cy_capsense_tuner_receive_callback_t)(uint8_t ** commandPacket, uint8_t ** tunerPacket, void * context);

